tap "codecrafters-io/tap"
tap "dashlane/tap"
tap "felixkratz/formulae"
tap "filosottile/musl-cross"
tap "hashicorp/tap"
tap "knqyf263/pet"
tap "mvp/uhubctl", "https://github.com/mvp/uhubctl"
tap "nikitabobko/tap"
tap "picnicsupermarket/picnic-cli"
tap "sapd/headsetcontrol"
tap "sst/tap"
tap "waydabber/betterdisplay"
tap "withgraphite/tap"
brew "xz"
brew "ansible-lint"
brew "arm-linux-gnueabihf-binutils"
brew "asimov"
brew "atuin"
brew "python@3.12"
brew "autojump"
brew "awscli"
brew "bash"
brew "bat"
brew "bc"
brew "black"
brew "bob"
brew "bottom"
brew "boxes"
brew "cairo"
brew "cdebug"
brew "cdrtools"
brew "clipboard"
brew "cloudflared"
brew "container-structure-test"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dbus"
brew "dnsmasq"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "doggo"
brew "exiv2"
brew "fastfetch"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fx"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grep"
brew "hadolint"
brew "helmfile"
brew "homeassistant-cli"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jid"
brew "jrnl"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
brew "lazydocker"
brew "lazygit"
brew "libffi"
brew "libvirt", restart_service: :changed
brew "lolcat"
brew "lsd"
brew "lua"
brew "luarocks"
brew "lynx"
brew "m1ddc"
brew "make"
brew "mas"
brew "mergiraf"
brew "minikube"
brew "mintoolkit"
brew "nethogs"
brew "nowplaying-cli"
brew "openssh"
brew "openssl@3.0"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "zopfli"
brew "pigz"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "poetry"
brew "poppler"
brew "protobuf"
brew "pstree"
brew "pv"
brew "pyenv"
brew "qbittorrent-cli"
brew "qemu"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rust"
brew "rust-analyzer"
brew "screen"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "skopeo"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "streamlink"
brew "switchaudio-osx"
brew "task"
brew "taskwarrior-tui"
brew "tcl-tk"
brew "terminal-notifier"
brew "trash", link: true
brew "uhubctl"
brew "vbindiff"
brew "vim"
brew "vit"
brew "viu"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "woff2"
brew "xmlstarlet"
brew "yarn"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "codecrafters-io/tap/codecrafters"
brew "dashlane/tap/dashlane-cli"
brew "felixkratz/formulae/borders"
brew "filosottile/musl-cross/musl-cross"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "knqyf263/pet/pet"
brew "picnicsupermarket/picnic-cli/picnic-cli"
brew "sapd/headsetcontrol/headsetcontrol", args: ["HEAD"]
brew "sst/tap/opencode"
brew "waydabber/betterdisplay/betterdisplaycli"
brew "withgraphite/tap/graphite"
cask "aerospace"
cask "affinity-designer"
cask "affinity-photo"
cask "alacritty"
cask "amethyst"
cask "appcleaner"
cask "arduino-ide"
cask "bambu-studio"
cask "bartender"
cask "basictex"
cask "betterdisplay"
cask "bettertouchtool"
cask "brave-browser"
cask "choosy"
cask "cleanshot"
cask "crossover"
cask "db-browser-for-sqlite"
cask "devutils"
cask "discord"
cask "firefox"
cask "firefox@developer-edition"
cask "flux-app"
cask "font-0xproto-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "hiddenbar"
cask "home-assistant"
cask "insomnia"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "launchcontrol"
cask "league-of-legends"
cask "linearmouse"
cask "lunar"
cask "macfuse"
cask "macmediakeyforwarder"
cask "minecraft"
cask "mqtt-explorer"
cask "obsidian"
cask "openscad"
cask "parallels"
cask "postman"
cask "proton-mail-bridge"
cask "protonvpn"
cask "rancher"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "soulver"
cask "soundsource"
cask "spotify"
cask "stats"
cask "steam"
cask "sublime-text"
cask "swiftdefaultappsprefpane"
cask "tailscale-app"
cask "telegram"
cask "the-unarchiver"
cask "time-out"
cask "vlc"
cask "vnc-viewer"
cask "wezterm@nightly"
cask "whatsapp"
cask "wireshark-app"
cask "yattee"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kulve", id: 6476389316
mas "Magnet", id: 441258766
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Peek", id: 1554235898
mas "reMarkable", id: 1276493162
mas "Sleeve", id: 1606145041
mas "Structured", id: 1499198946
mas "Xcode", id: 497799835
