tap "bramstein/webfonttools"
tap "dashlane/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "knqyf263/pet"
tap "mrkai77/cask"
tap "nikitabobko/tap"
tap "waydabber/betterdisplay"
brew "asimov"
brew "python@3.12"
brew "autojump"
brew "bash"
brew "bat"
brew "bc"
brew "black"
brew "brew-cask-completion"
brew "clipboard"
brew "gmp"
brew "coreutils"
brew "curl"
brew "doggo"
brew "exiv2"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "homeassistant-cli"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jid"
brew "jq"
brew "lsd"
brew "lua"
brew "lynx"
brew "mas"
brew "moreutils"
brew "neovim"
brew "nethogs"
brew "node"
brew "nowplaying-cli"
brew "nvm"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "zopfli"
brew "pigz"
brew "pipx"
brew "poetry"
brew "protobuf"
brew "pstree"
brew "pv"
brew "qbittorrent-cli"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "rustfmt"
brew "screen"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "streamlink"
brew "tldr"
brew "trash"
brew "tree"
brew "vbindiff"
brew "vim"
brew "wget"
brew "woff2"
brew "xmlstarlet"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "dashlane/tap/dashlane-cli"
brew "jesseduffield/lazygit/lazygit"
brew "knqyf263/pet/pet"
cask "aerospace"
cask "affinity-designer"
cask "affinity-photo"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "arduino-ide"
cask "bambu-studio"
cask "bartender"
cask "betterdisplay"
cask "bettertouchtool"
cask "chatty"
cask "choosy"
cask "cleanshot"
cask "crossover"
cask "devutils"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox@developer-edition"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
cask "google-chrome"
cask "hammerspoon"
cask "intellij-idea"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "launchcontrol"
cask "league-of-legends"
cask "linearmouse"
cask "loop"
cask "lunar"
cask "macmediakeyforwarder"
cask "minecraft"
cask "mqtt-explorer"
cask "obsidian"
cask "paragon-extfs"
cask "parallels"
cask "protonmail-bridge"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "soulver"
cask "soundsource"
cask "spotify"
cask "stats"
cask "steam"
cask "sublime-text"
cask "tailscale"
cask "telegram"
cask "the-unarchiver"
cask "time-out"
cask "transmission"
cask "vlc"
cask "vmware-fusion"
cask "vnc-viewer"
cask "whatsapp"
cask "wireshark"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Peek", id: 1554235898
mas "rcmd", id: 1596283165
mas "reMarkable", id: 1276493162
mas "Sleeve", id: 1606145041
mas "Structured", id: 1499198946
